
Page({

  /**
   * 页面的初始数据
   */
  data: {
    question: [{
      question: "61．混合血栓见于（ ）",
      A: "A.静脉血栓的头部",
      B: "B.DIC毛细血管内",
      C: "C.急性风湿性心内膜炎的瓣膜闭锁缘",
      D: "D.静脉血栓的尾部",
      E: "E.静脉血栓的体部",
    }, {
        question: "62．小儿发病率及死亡率最高的年龄期是（ ）",
      A: "A.婴儿期",
      B: "B.新生儿期",
      C: "C.幼儿期",
      D: "D.学龄前期",
      E: "E.学龄期",
    }, {
        question: "63．快反应细胞与慢反应细胞的区别是（ ）",
      A: "A.0期去极的快慢",
      B: "B.1期复极的快慢",
      C: "C.2期复极的快慢",
      D: "D.3期复极的快慢",
      E: "E.4期自动去极的快慢",
    }, {
        question: " 64．环境的生态平衡是指（ ）",
      A: "A.自然环境中各种生物间的动态平衡",
      B: "B.人与环境间物质转换的平衡",
      C: "C.环境中生物之间，生物与环境之间的动态平衡",
      D: "D.环境中非生物因素与人类之间的动态平衡",
      E: "E.生物体内各种物质的吸收与排泄之间动态平衡",
    }, {
        question: " 65．医学心理学这门学科属于（ ）",
      A: "A.社会心理学",
      B: "B.临床心理学",
      C: "C.心身医学",
      D: "D.应用心理学",
      E: "E.行为医学",
    }, {
        question: " 66．某人的红细胞与B型血的血浆凝集，其血浆与B型血的红细胞不凝集，此人的血型为（ )",
      A: "A.A型",
      B: "B.B型",
      C: "C.AB型",
      D: "D.O型",
      E: "E.Rh阳性",
    }, {
        question: " 67．哪项病理变化不属于慢性萎缩性胃炎（ ）",
      A: "A.胃粘膜固有腺体数量减少",
      B: "B.胃固有腺体被肠腺样腺体所代替",
      C: "C.胃上皮异型增生",
      D: "D.幽门腺组织化生",
      E: "E.近粘膜浅层有炎症细胞浸润",
    }, {
        question: "68．经产前检查，医生应提出终止妊娠的医学意见的胎儿疾病诊断是：（ ）",
      A: "A.有严重遗传性疾病",
      B: "B.有羊水过多表现",
      C: "C.有胎儿过大表现",
      D: "D.有六指畸形表现",
      E: "E.有马蹄内翻足表现",
    }, {
        question: "69．正常人肾小球滤过率和肾血浆流量的比值是（ ）",
      A: "A.1%",
      B: "B.19%",
      C: "C.50%",
      D: "D.70%",
      E: "E.90%",
    }, {
        question: "70．新生儿化脓性脑膜炎的病原菌是（ ）",
      A: "A.脑膜炎双球菌",
      B: "B.肺炎双球菌",
      C: "C.流感杆菌",
      D: "D.大肠杆菌",
      E: "E.铜绿假单胞杆菌",
    }, {
        question: "71．对患者死因有异议的，应在48小时内进行尸检，具备冷冻条件的可以延长至（ ）",
      A: "A.3天",
      B: "B.4天",
      C: "C.5天",
      D: "D.6天",
      E: "E.7天",
    }, {
        question: "72．G1P0，妊36周，过去无高血压史，无明显自觉症状，血压155／100mmHg，水肿（＋＋），尿蛋白（＋）。本例诊断为（ ）",
      A: "A.轻度妊高征",
      B: "B.中度妊高征",
      C: "C.先兆子痫",
      D: "D.子痫",
      E: "E.妊娠合并原发性高血压",
    }, {
        question: "73．醛固酮的主要作用是促进（ ）",
      A: "A.近曲小管保钠排钾",
      B: "B.远曲小管和集合管保钠排钾",
      C: "C.远曲小管和集合管保钾排钠",
      D: "D.近曲小管保钾排钠",
      E: "E.增加肾髓袢保钠排钾",
    }, {
        question: "74．3～6个月佝偻病患儿，多见的骨骼系统改变是（ ）",
      A: "A.方颅",
      B: "B.胸廓畸形",
      C: "C.手镯、脚镯征",
      D: "D.颅骨软化",
      E: "E.下肢畸形",
    }, {
        question: "75．胃最具有生理意义的运动是（ ）",
      A: "A.蠕动",
      B: "B.紧张性收缩",
      C: "C.容受性舒张",
      D: "D.强直收缩",
      E: "E.集团运动",
    }, {
        question: "76．由于物质代谢障碍，在细胞内或间质中出现了异常物质或原有正常物质数量显著增多称为（ ）",
      A: "A.变性",
      B: "B.增生",
      C: "C.化生",
      D: "D.坏死",
      E: "E.变质",
    }, {
        question: "77．在再障的发病机制中，最主要的机制为（ ）",
      A: "A.造血干细胞受损",
      B: "B.造血微环境缺陷",
      C: "C.免疫制剂异常",
      D: "D.核苷酸代谢异常",
      E: "E.遗传基因缺陷",
    }, {
        question: "78．下列哪项符合门脉性肝硬化的典型病理变化（ )",
      A: "A.广泛的肝细胞变性坏死",
      B: "B.正常肝小叶结构破坏",
      C: "C.结缔组织增生",
      D: "D.肝内血管网改建",
      E: "E.再生结节及假小叶形成",
    }, {
        question: "79．下列疾病中不属于心身疾病的是（ ）",
      A: "A.恐怖性神经症",
      B: "B.冠心病",
      C: "C.原发性高血压",
      D: "D.支气管哮喘",
      E: "E.癌症",
    }, {
        question: "80．一个健康儿能叫出物品名，对人及事物有爱憎之分，能弯腰抬东西，出牙8个，脊柱有3个弯曲，其月龄可能是（ ）",
      A: "A.8个月",
      B: "B.9个月",
      C: "C.10个月",
      D: "D.11个月",
      E: "E.12个月",
    }, {
        question: "81．引起1型超敏反应的主要因素是（ ）",
      A: "A.IgE",
      B: "B.IgM",
      C: "C.IgG",
      D: "D.IgD",
      E: "E.IgA",
    }, {
        question: "82．26岁妇女，因妊娠8周行负压吸宫人工流产术。术中出现血压下降、心率过慢、面色苍白、出汗、胸闷，应考虑为（ ）",
      A: "A.子宫穿孔",
      B: "B.腹腔内出血",
      C: "C.吸宫不全",
      D: "D.羊水栓塞",
      E: "E.人工流产综合征",
    }, {
        question: "83．以下哪项是由负反馈调节的生理过程（ ）",
      A: "A.分娩",
      B: "B.排尿反射",
      C: "C.降压反射",
      D: "D.小肠运动",
      E: "E.血液凝固",
    }, {
        question: "84．佝偻病性手足搐搦症的典型症状中，喉痉挛主要见于（ ）",
      A: "A.婴儿",
      B: "B.幼儿",
      C: "C.学龄前期儿童",
      D: "D.学龄期儿童",
      E: "E.青春期",
    }, {
        question: "85．癌症的易感人格为（ ）",
      A: "A.A型人格",
      B: "B.B型人格",
      C: "C.C型人格",
      D: "D.混合型人格",
      E: "E.以上都不是",
    }, {
        question: "86．下列关于青霉素类的叙述哪一项是不正确的（ ）",
      A: "A.青霉素G高效、低毒、窄谱",
      B: "B.青霉素G对梅毒及钩端螺旋体有效",
      C: "C.氨苄青霉素对伤寒有效",
      D: "D.主要不良反应为过敏反应",
      E: "E.青霉素G对革兰阳性杆菌无效",
    }, {
        question: "87．组织处于绝对不应期，其兴奋性（ ）",
      A: "A.为零",
      B: "B.高于正常",
      C: "C.低于正常",
      D: "D.无限大",
      E: "E.正常",
    }, {
        question: "88．不属于凝固性坏死的病变是（ ）",
      A: "A.肝阿米巴脓肿",
      B: "B.心肌梗死",
      C: "C.干酪样坏死",
      D: "D.肾梗死",
      E: "E.肝细胞嗜酸性小体",
    }, {
        question: "89．心动周期中，左室内压升高速率最快的时相在（ ）",
      A: "A.心房收缩期",
      B: "B.等容收缩期",
      C: "C.快速射血期",
      D: "D.减慢射血期",
      E: "E.快速充盈期",
    }, {
        question: "90．昼夜体温变动的特点是（ ）",
      A: "A.昼夜间体温呈现周期性波动",
      B: "B.午后4～6时体温最低",
      C: "C.上午8～10时体温最高",
      D: "D.昼夜间波动的幅度超过1℃",
      E: "E.体温昼夜的变化与生物节律无关",
    }],
    anserList: [{
      answer: "61~65:EBACD"
    }, {
      answer: "66~70:CEABD"
    }, {
      answer: "71~75:EBBDC"
    }, {
      answer: "76~80:ACEAE"
    }, {
      answer: "81~85:AECAC"
    }, {
      answer: "86~90:EAABA"
    }

    ]
  },
  // 点击菜单切换章节
  showModal(e) {
    this.setData({
      modalName: e.currentTarget.dataset.target
    })
  },
  hideModal(e) {
    this.setData({
      modalName: null
    })
  }
})