// pages/test/one1/one1.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    question: [{
      question: "1．肠结核最常见的感染途径（ ）",
      A: "A.直接蔓延",
      B: "B.血行传播",
      C: "C.经口传播",
      D: "D.经淋巴结传播",
      E: "E.垂直传播",
    }, {
      question: "2．风湿热最常见的皮肤损害是（ ）",
      A: "A.环形红斑",
      B: "B.结节性红斑",
      C: "C.蝶形红斑",
      D: "D.多形红斑",
      E: "E.圆形红斑",
    }, {
      question: " 3．绒毛膜癌最常见的死亡原因是（ ）",
      A: "A.肺转移",
      B: "B.肝转移",
      C: "C.肾转移",
      D: "D.胃肠道转移",
      E: "E.脑转移",
      },{
        question: " 4．小儿生理性贫血发生于生后（ ）",
        A: "A.1～2周",
        B: "B.2～3周",
        C: "C.1～2个月",
        D: "D.2～3个月",
        E: "E.6个月",
      },{
        question: " 5．甲亢时最常见的心律失常是（ ）",
        A: "A.心房纤颤",
        B: "B.房室传导阻",
        C: "C.房性扑动",
        D: "D.室性心动过速",
        E: "E.室性期前收缩",
      }, {
        question: " 6．心肌不会产生强直收缩，其原因是（ )",
        A: "A.心肌是功能上的合胞体",
        B: "B.心肌肌浆网不发达，Ca2+贮存少",
        C: "C.心肌的有效不应期特别长",
        D: "D.心肌有自律性，会自动节律收缩",
        E: "E.心肌呈“全或无”收缩",
      }, {
        question: " 7．初产妇，会阴侧切后胎头吸引器助产，新生儿体重4200g，总产程21小时。产后2小时内阴道出血约400ml，导致此产妇出血较多最可能的原因是（ ）",
        A: "A.宫颈裂伤",
        B: "B.产后宫缩乏力",
        C: "C.胎盘残留",
        D: "D.产妇疲劳",
        E: "E.膀胱充盈",
      }, {
        question: "8．以下哪一项不是肺炎合并心衰的诊断要点（ ）",
        A: "A.呼吸突然加快> 60次 /min",
        B: "B.心率突然变成180次 /min",
        C: "C.心音低钝，奔马律",
        D: "D.肝脏迅速增大",
        E: "E.双肺密集中、小水泡音",
      }, {
        question: "9.急性颅内压增高的典型表现是（ ）",
        A: "A.意识障碍",
        B: "B.头颅增大",
        C: "C.剧烈头痛，频繁呕吐",
        D: "D.一侧瞳孔散大",
        E: "E.双眼视力下降",
      }, {
        question: "10．结核菌素试验结果判定的观察时间是（ ）",
        A: "A.4～8周",
        B: "B.1周",
        C: "C.48～72小时",
        D: "D.24小时",
        E: "E.20分钟",
      }, {
        question: "11．心力衰竭的最常见的诱因是（ ）",
        A: "A.静脉输液过多过快",
        B: "B.情绪激动",
        C: "C.不当使用β受体阻滞剂",
        D: "D.肺部感染",
        E: "E.缺血加重",
      }, {
        question: "12．最常见的功血为（ ）",
        A: "A.黄体功能不全",
        B: "B.子宫内膜脱落不全",
        C: "C.排卵期出血",
        D: "D.排卵型月经过多",
        E: "E.无排卵性功血",
      }, {
        question: "13．小儿腹泻轻度脱水的临床表现，下列哪项是错误的（ ）",
        A: "A.精神稍差",
        B: "B.皮肤稍干燥",
        C: "C.前囟眼窝稍凹陷",
        D: "D.尿量稍减少",
        E: "E.四肢稍凉",
      }, {
        question: "14．关于股骨颈骨折的描述不正确的是（ ）",
        A: "A.好发于老年女性",
        B: "B.囊内的头下型骨折固定不好极易形成股骨头缺血坏死",
        C: "C.患肢多呈短缩、外旋、内收畸形，大转子上移",
        D: "D.内收型骨折，剪力小、较稳定，愈合率高",
        E: "E.一般需要手术切开复位内固定",
      }, {
        question: "15．诊断一氧化碳中毒最有意义的辅助检查是（ ）",
        A: "A.血液碳氧血红蛋白浓度测定",
        B: "B.血氧饱和度测定",
        C: "C.脑电图测定",
        D: "D.高铁血红蛋白测定",
        E: "E.脑CT检查",
      }, {
        question: "16．关于肱骨髁上骨折的叙述错误的是（ ）",
        A: "A.多为间接暴力引起",
        B: "B.屈曲型肱骨髁上骨折易并发血管神经损伤",
        C: "C.肘后三角正常则说明是伸直型骨折",
        D: "D.伸直型肱骨髁上骨折容易导致前臂骨筋膜室综合征",
        E: "E.严重者一般需手术切开复位内固定",
      }, {
        question: "17．下列十二指肠溃疡穿孔的诱因，除外的是（ ）",
        A: "A.情绪激动",
        B: "B.暴食",
        C: "C.进刺激性食物",
        D: "D.过度疲劳",
        E: "E.腹内压增高",
      }, {
        question: "18.叩击跟腱引起相连的同块肌肉收缩，属于（ )",
        A: "A.肌紧张",
        B: "B.腱反射",
        C: "C.屈肌反射",
        D: "D.姿势反射",
        E: "E.多突触反射",
      }, {
        question: "19．溃疡性结肠炎并发中毒性巨结肠最严重的部位是（ ）",
        A: "A.直肠",
        B: "B.乙状结肠",
        C: "C.降结肠",
        D: "D.横结肠",
        E: "E.升结肠",
      }, {
        question: "20．判断小儿体格生长的主要指标有（ ）",
        A: "A.体重、身长、体围的测量",
        B: "B.对外界反应能力的发育",
        C: "C.运动功能的发育",
        D: "D.语言发育",
        E: "E.牙齿的发育",
      }, {
        question: "21．下列哪项与输卵管妊娠无关（ ）",
        A: "A.继发不孕3年",
        B: "B.停经40天伴少量阴道流血7天",
        C: "C.左下腹疼痛",
        D: "D.休克",
        E: "E.阴道排出蜕膜组织中见少量绒毛",
      }, {
        question: "22．关于早产儿特点，哪项是错误的（ ）",
        A: "A.出生体重一般<2500g",
        B: "B.皮肤红润，胎毛多，足底纹少",
        C: "C.呼吸不规则，常出现暂停现象",
        D: "D.生理性黄疸持续时间较长",
        E: "E.肌张力较高",
      }, {
        question: "23．属于机械性肠梗阻的是（ ）",
        A: "A.先天性肠道闭锁引起的肠梗阻",
        B: "B.由于慢性铅中毒肠痉挛引起的肠梗阻",
        C: "C.急性弥漫性腹膜炎引起的肠梗阻",
        D: "D.由于肠道功能紊乱引起的肠梗阻",
        E: "E.由于肠系膜血管栓塞引起的肠梗阻",
      }, {
        question: "24．原发性肾病综合征最常见的并发症为（ ）",
        A: "A.感染",
        B: "B.休克",
        C: "C.血栓形成",
        D: "D.电解质紊乱",
        E: "E.营养不良",
      }, {
        question: "25．以下哪种肿瘤是恶性的（ ）",
        A: "A.脂肪瘤",
        B: "B.淋巴瘤",
        C: "C.乳头状瘤",
        D: "D.纤维状瘤",
        E: "E.囊腺瘤",
      }, {
        question: "26．初产妇，产钳助产娩出4200g男婴，胎盘娩出后出现时多时少间歇性阴道出血，宫体柔软，最可能的原因是（ ）",
        A: "A.宫颈裂伤",
        B: "B.凝血功能障碍",
        C: "C.产后宫缩乏力",
        D: "D.胎盘部分剥离",
        E: "E.阴道静脉破裂",
      }, {
        question: "27．尿毒症患者体内哪种物质缺乏（ ）",
        A: "A.肾素",
        B: "B.血管紧张素",
        C: "C.1，25二羟维生素D3",
        D: "D.甲状旁腺素",
        E: "E.肌酐",
      }, {
        question: "28．动脉粥样硬化最好发的部位是（ ）",
        A: "A.主动脉",
        B: "B.冠状动脉",
        C: "C.肾动脉",
        D: "D.脑动脉",
        E: "E.下肢动脉",
      }, {
        question: "29．引起左心衰竭的临床表现的主要原因是（ ）",
        A: "A.肺淤血、肺水肿",
        B: "B.左心室扩大",
        C: "C.体循环静脉压增高",
        D: "D.肺动脉压增高",
        E: "E.心室重构",
      }, {
        question: "30．形成胸内负压的主要因素是（ ）",
        A: "A.肺的回缩力",
        B: "B.呼吸肌的收缩和舒张",
        C: "C.肺泡的表面张力",
        D: "D.肺泡表面活性物质",
        E: "E.肺的顺应性",
      }    
    ],
    anserList:[{
      answer:"1~5:CAEDA"
    },{
      answer: "6~10:CBECC"
    },{
      answer: "11~15:DEEDA"
    },{
      answer: "16~20:BEBDA"
    },{
      answer: "21~25:EEAAB"
    },{
      answer: "26~30:CCAAA"
    }
    
    ]
  }, 
  // 点击菜单切换章节
  showModal(e) {
    this.setData({
      modalName: e.currentTarget.dataset.target
    })
  },
  hideModal(e) {
    this.setData({
      modalName: null
    })
  } 
})