
Page({

  /**
   * 页面的初始数据
   */
  data: {
    question: [{
      question: "91．诊断轻微肝性脑病最有价值的方法是（ ）",
      A: "A.血氨测定",
      B: "B.脑电图",
      C: "C.脑ＣＴ",
      D: "D.心理智能测试",
      E: "E.临床表现",
    }, {
        question: "92．急性病毒性肝炎（普通型）的病变特点是肝细胞（ ）",
      A: "A.广泛变性，坏死轻微",
      B: "B.广泛坏死，变性轻微",
      C: "C.广泛再生，变性较轻",
      D: "D.广泛坏死，再生较轻",
      E: "E.变性、坏死、再生均广泛",
    }, {
        question: "93．医学模式转变对医师提出的根本性医德要求是（ ）",
      A: "A.学习伦理学",
      B: "B.学习生命价值论",
      C: "C.学习公益论",
      D: "D.更加关注处于社会关系中的、作为一个整体的病人的人文方面",
      E: "E.注重改变传统的医学道德观念",
    }, {
        question: " 94．治疗伴有心功能不全的支气管哮喘急性发作宜选用（ ）",
      A: "A.氨茶碱",
      B: "B.色甘酸钠",
      C: "C.克伦特罗",
      D: "D.麻黄碱",
      E: "E.丙酸倍氯米松",
    }, {
        question: "95.急性肾小球肾炎的病理改变（ ）",
      A: "A.系膜增生性肾小球肾炎",
      B: "B.系膜毛细血管性肾小球肾炎",
      C: "C.膜性肾病",
      D: "D.毛细血管内增生性肾小球肾炎",
      E: "E.毛细血管外增生性肾小球肾炎",
    }, {
        question: "96.结核病预防性化疗的疗程是（ )",
      A: "A.3个月",
      B: "B.6个月",
      C: "C.12个月",
      D: "D.18个月",
      E: "E.24个月",
    }, {
        question: " 97．类风湿关节炎关节的主要病理改变是（ ）",
      A: "A.血管炎",
      B: "B.软骨变性",
      C: "C.肌腱附着点炎",
      D: "D.滑膜炎",
      E: "E.骨侵蚀",
    }, {
        question: "98．引起流行性脑脊髓膜炎的病原体是（ ）",
      A: "A.脑膜炎双球菌",
      B: "B.金黄色葡萄球菌",
      C: "C.肺炎双球菌",
      D: "D.乙脑病毒",
      E: "E.淋病奈瑟球菌",
    }, {
        question: "99．能提供一碳单位的氨基酸是（ ）",
      A: "A.酪氨酸",
      B: "B.赖氨酸",
      C: "C.丙氨酸",
      D: "D.色氨酸",
      E: "E.谷氨酸",
    }, {
        question: "100．卵巢肿瘤最常见的并发症是（ ）",
      A: "A.囊肿破裂",
      B: "B.感染",
      C: "C.蒂扭转",
      D: "D.恶性变",
      E: "E.肿瘤远处转移",
      },{
        question: "101.男性，41岁，上腹部痛8小时，伴恶心、呕吐，体温38．4℃。体查：轻度黄染，全腹均有压痛，以脐上明显，反跳痛（+），轻度肌紧张，移动性浊音（—），肠鸣音正常。血清淀粉酶：256u（温氏）。B超：胰腺肿大，边缘不清，胆管轻度扩张，下段有结石。经保守治疗，症状缓解，下一步最合适的处理是（ ）",
        A: "A.对症处理",
        B: "B.中药治疗",
        C: "C.择期胆囊切除术",
        D: "D.择期胆总管探查取石",
        E: "E.择期做胰腺及周围坏死组织清除引流",
      }, {
        question: "102.男婴8个月，突然抽搐，抽搐时神志不清，双眼上窜，约2~3分钟自然缓解，近二日共发作5次，不伴发热，抽搐后入睡，醒后活泼如常。查体：营养中等，枕突明显，囟门2.0cm×2.0cm平坦，颈软，血糖4.2mmol/L，血钙1.74 mmol/L，血磷0.8 mmol/L，血镁0.76 mmol/L，诊断为（ ）",
        A: "A.低血糖",
        B: "B.婴儿痉挛症",
        C: "C.低镁血症",
        D: "D.维生素D缺乏性手足搐搦症",
        E: "E.化脑",
      }, {
        question: "103．女性，30岁，右乳头反复溢血性液体1年余，查体：右乳头下课扪及直径约1．0cm大小的肿块，稍活动。应首先考虑（ ）",
        A: "A.乳腺结核",
        B: "B.乳腺纤维腺瘤",
        C: "C.乳腺囊性增生病",
        D: "D.乳管内乳头状瘤",
        E: "E.乳管内乳头状癌",
      }, {
        question: "104．男性，25岁，抬重物时腰剧痛，继而右下肢麻痛，检查：腰部有肌痉挛，活动受限并有侧弯现象，L4~5间隙有明显压痛和扣痛，临床诊断最可能是（ ）",
        A: "A.腰椎骨折",
        B: "B.腰椎脱位",
        C: "C.腰扭伤",
        D: "D.腰椎间盘突出症",
        E: "E.蛛网膜下腔出血",
      }, {
        question: "105．女性，18岁，双侧甲状腺弥漫性肿大1年，体查：甲状腺Ⅰ度肿大，未及结节、震颤及血管杂音，心率90次/分，血压110/80mmHg，131I吸收试验15%/2h、40%/24h ．此患者在治疗上应首选（ ）",
        A: "A.口服他巴唑",
        B: "B.口服小剂量甲状腺素",
        C: "C.手术切除甲状腺",
        D: "D.口服大剂量碘剂",
        E: "E. 肌内注射碘油",
      }, {
        question: "106．男性患者，14岁，发热、咽痛7天，出现眼睑水肿，血压130/80mmHg，尿常规蛋白（+），RBC 20~30个/ HP。肾活检：毛细血管内增生性肾炎，最可能的诊断是（ )",
        A: "A.急性肾炎",
        B: "B.急进性肾炎",
        C: "C.隐匿性肾炎",
        D: "D.肾病综合症",
        E: "E.慢性肾炎",
      }, {
        question: "107．女性，37岁，既往健康，发热、咳铁锈色痰2天，诊断最可能是（ ）",
        A: "A.真菌性肺炎",
        B: "B.支原体肺炎",
        C: "C.金葡菌肺炎",
        D: "D.病毒性肺炎",
        E: "E.肺炎链球菌肺炎",
      }, {
        question: "108．在腹部闭合性损伤的病例中，造成胃、空肠、回肠穿孔后，在手术治疗中，修补的顺序为（ ）",
        A: "A.空肠、胃、回肠",
        B: "B.胃、空肠、回肠",
        C: "C.回肠、空肠、胃",
        D: "D.空肠、回肠、胃",
        E: "E.回肠、胃、空肠",
      }, {
        question: "109．急诊室送来一病人，病史不清，昏迷不醒、抽搐。查：呼吸困难，皮肤湿冷，瞳孔明显缩小，下列哪种疾病可能性大（ ）",
        A: "A.一氧化碳中毒",
        B: "B.阿托品中毒",
        C: "C.巴比妥类药物中毒",
        D: "D.有机磷杀虫剂中毒",
        E: "E.脑血管意外",
      }, {
        question: "110．男，15岁，昏迷一天，呼吸深大，血压90/60mmHg，心率120次/分，脱水貌，血糖24 mmol/L．，血钠140 mmol/L，CO2CP9 mmol/L，尿酮体3+，可能的诊断是（ ）",
        A: "A.高渗性非酮症糖尿病昏迷",
        B: "B.乳酸性酸中毒",
        C: "C.糖尿病酮症酸中毒",
        D: "D.低血糖昏迷",
        E: "E.脑血管意外",
      }, {
        question: "111．男性，20岁，右腹部撞伤后6小时来诊，持续腹痛，先于脐周，后蔓延至全腹。体查：神清，血压100/85mmHg，全腹压痛和反跳痛，腹肌紧张，移动性浊音可疑，血红蛋白140g/L，白细胞11×109/L，中性0.86。首先考虑的是（ ）",
        A: "A.脾破裂",
        B: "B.肠破裂",
        C: "C.腹壁挫伤",
        D: "D.肝破裂",
        E: "E.胰腺挫裂伤",
      }, {
        question: "112．6个月男孩，发热、咳嗽、喘憋3天。查体：面色苍白，口唇发绀，体温37．8℃，呼吸70次/分，伴明显鼻煽及三凹征，双肺密集喘鸣音，肺底油细湿罗音，心率190次/分，心音低钝，肝肋下3.5cm。白细胞7.0×109/L，淋巴细胞为75%。本病例诊断最可能是（ ）",
        A: "A.葡萄球菌肺炎",
        B: "B.腺病毒肺炎",
        C: "C.呼吸道合胞病毒肺炎",
        D: "D.革兰氏阴性杆菌肺炎",
        E: "E.肺炎支原体肺炎",
      }, {
        question: "113．10岁男孩，膝部疼痛，发热。血常规示白细胞2.5×109/L，在胫骨上端穿刺抽出脓液。此时治疗最佳方案为（ ）",
        A: "A.患肢制动",
        B: "B.大剂量联合抗生素应用",
        C: "C.理疗",
        D: "D.输血补液支持治疗",
        E: "E.胫骨开窗引流术",
      }, {
        question: "114．男患，38岁，突然呕血1周。查体贫血外观，肝脾轻度肿大，有少量腹腔积液。为明确诊断应进行哪项检查（ ）",
        A: "A.肝胆超声",
        B: "B.肝功能测定",
        C: "C.胃镜",
        D: "D.血常规",
        E: "E.乙肝标志物",
      }, {
        question: "115．男性，60岁，因消瘦，乏力近一年来院就诊，体检：右下腹包块4cm×6cm，边界清，无明显压痛，钡灌肠提示为盲肠癌可能，对该患行根治性右半结肠切除术应包括下列肠段和范围，除了（ ）",
        A: "A.包括肝曲和脾曲的整个横结肠",
        B: "B.回肠末20cm",
        C: "C.盲肠",
        D: "D.升结肠",
        E: "E.横结肠右半侧",
      }, {
        question: "116．女性，50岁，有胆石症病史，突发中上腹痛12小时，诊断为急性胰腺炎，如出现下列哪种情况，预后最凶险（ ）",
        A: "A.血钙1.25mmol/L",
        B: "B.脐部及腰部皮肤出现紫斑",
        C: "C.血尿淀粉酶不增高",
        D: "D.出现黄疸",
        E: "E.持续性高热",
      }, {
        question: "117.女性，50岁，右乳房癌根治性手术后2个月，逐渐出现右上臂肿胀不退，无发热、疼痛，经非手术治疗效果不佳。应考虑下列哪一种情况（ ）",
        A: "A.患侧皮肤感染",
        B: "B.腋窝淋巴积液",
        C: "C.静脉回流受阻",
        D: "D.腋窝淋巴结转移",
        E: "E.淋巴液回流受阻",
      }, {
        question: "118．一患者，大量饮酒10年，2天前终止饮酒，继而出现激越、凭空听到其他人称其同性恋，意识清楚，定向力完好。患者所出现的症状是（ ）",
        A: "A.精神分裂症",
        B: "B.焦虑障碍",
        C: "C.药物中毒",
        D: "D.酒精中毒性幻觉症",
        E: "E.震颤谵妄",
      }, {
        question: "119．男性，50岁，体检B超发现肝脏右叶约2cm实性占位病变，查甲胎蛋白（AFP）1000ng/ml，肝功能正常，10年前有肝炎病史。最佳处理方案是（ ）",
        A: "A.化疗",
        B: "B.放疗",
        C: "C.肝动脉栓塞术",
        D: "D.手术切除",
        E: "E.观察随访",
      }, {
        question: "120．18岁女学生，平素健康，因故悲伤大哭不止，四肢麻木、头晕、胸闷、病后30分钟做血气分析，PaCO220mmHg、pH7.46，PaO296mmHg、HCO3-22mmol/L，哪种可能性大（ ）",
        A: "A.急性上呼吸道感染",
        B: "B.急性呼吸衰竭",
        C: "C.支气管哮喘发作",
        D: "D.过度通气、呼碱",
        E: "E.自发性气胸",
      }],
    anserList: [{
      answer: "91~95:DADAD"
    }, {
      answer: "96~100:BDADC"
    },{
        answer: "101~105:DDDDB"
    }, {
        answer: "106~110:EECDC"
    }, {
        answer: "111~115:BCECA"
    }, {
        answer: "116~120:EEDDD"
      }]
  },
  // 点击菜单切换章节
  showModal(e) {
    this.setData({
      modalName: e.currentTarget.dataset.target
    })
  },
  hideModal(e) {
    this.setData({
      modalName: null
    })
  }
})